import random
# Создаем случайный список из 20 значений, каждая из которых является списком из 4 случайных целых чисел от -10 до 10.
a = [[random.randint(-10,10) for i in range(4)] for k in range(20)]
print(a)
# Создаем пустой список для хранения уникальных комбинаций пар
b = list()
# Сортируем каждый вложенный список (список из 4 чисел)
for i in a:
    i.sort()
# Перебираем все элементы в списке `a`
for el in a:
    # Если элемент встречается только один раз в списке `a`
    if a.count(el) == 1:
        # Преобразуем элемент в кортеж и добавляем в список `b`
        x = tuple(el)
        b.append(x)
# Выводим уникальные комбинации
print("Уникальные комбинации:")
print(b)
# Запрашиваем у пользователя ввод целого числа
x = int(input("Введи целое число: "))
# Инициализируем счетчик для подсчета пар
count = 0
# Перебираем все кортежи в списке `b`
for arr in b:
    # Инициализируем сумму для текущего кортежа
    sum = 0
    # Суммируем все элементы в текущем кортеже
    for el in arr:
        sum += el
    # Если сумма элементов меньше введенного числа `x`, увеличиваем счетчик
    if sum < x:
        count += 1
# Выводим количество пар, чья сумма меньше введенного числа
print("Кол-во пар, чья сумма меньше:", count)
